{
    "intents":[
    {
        "tag": "greeting",
        "input": ["Hello!",
                    "Hi there!",
                    "Hey!",
                    "Greetings!",
                    "Good day!",
                    "Hi!",
                    "Hello, chatbot!",
                    "Hey there!",
                    "Howdy!",
                    "What's up?",
                    "Good morning!",
                    "Good afternoon!",
                    "Good evening!",
                    "Yo!",
                    "Hiya!",
                    "Hey, how's it going?",
                    "Hi, nice to meet you!",
                    "Hello again!",
                    "Hi, chatbot!",
                    "Hey, what's new?", 
                    "How are you"],
        "response": [],
        "follow-up":[]   
    },
    {
        "tag": "bye",
        "input": [
            "Goodbye!",
            "See you later!",
            "Bye!",
            "Talk to you soon!",
            "Farewell!",
            "Catch you later!",
            "Until next time!",
            "Later!",
            "Take care!",
            "Peace out!",
            "So long!",
            "Adios!",
            "Bye for now!",
            "I'm signing off.",
            "Gotta go!",
            "Have a great day!",
            "Thanks, bye!",
            "See you next time!",
            "It's been nice talking to you. Goodbye!",
            "Catch you on the flip side!"
        ],
        "response": ["Bye!, I hope you use our app again.", "Thanks for using our app"]
    },
    {
        "tag": "inquiry",
        "input": [
            "What are the most trending computer parts right now?",
            "Which computer components are currently popular for gaming PCs?",
            "What are the latest trends in computer hardware?",
            "What are the best CPUs for gaming in 2023?",
            "Which GPUs are trending for high-performance gaming?",
            "What are the top SSDs for fast storage solutions?",
            "Are there any new motherboards that support the latest processors?",
            "What RAM is recommended for a high-end build this year?",
            "What are the best budget-friendly computer parts trending now?",
            "Which mid-range GPUs offer the best value for money?",
            "Are there any affordable CPUs that are popular right now?",
            "What are the fastest SSDs available in the market?",
            "Which CPUs offer the best multi-threading performance?",
            "What GPUs are best for 4K gaming?",
            "Which computer parts are compatible with the latest Intel/AMD processors?",
            "What are the best cases for a high-airflow build?",
            "Are there any new power supplies that are highly rated?",
            "What are the latest NVIDIA GPUs and how do they perform?",
            "Are there any new AMD Ryzen processors that are trending?",
            "What are the best ASUS motherboards for gaming?",
            "Which computer parts are future-proof for the next few years?",
            "What are the best components for a VR-ready PC?",
            "Are there any parts that support upcoming technologies like PCIe 5.0?",
            "How do the latest AMD GPUs compare to NVIDIA's offerings?",
            "What are the differences between the latest Intel and AMD CPUs?",
            "Which brand offers better value for high-performance builds?",
            "Are there any computer parts that are hard to find due to high demand?",
            "What are the price trends for GPUs this year?",
            "Are there any new releases expected soon that might affect current trends?",
            "What are the best computer parts for a video editing build?",
            "Which components are recommended for a streaming PC?",
            "What are the best parts for a compact mini-ITX build?",
            "What are the best computer parts for building a workstation in 2023?",
            "Which components are trending for AI and machine learning builds?",
            "What are the most popular cooling solutions for high-performance PCs?",
            "Are there any new trends in RGB lighting for PC components?",
            "What are the best PSUs for energy-efficient builds?",
            "Which computer parts are recommended for overclocking enthusiasts?",
            "What are the top-rated monitors for gaming and productivity?",
            "Are there any new trends in wireless networking for PCs?",
            "What are the best peripherals to pair with a high-end gaming PC?",
            "Which components are trending for silent PC builds?",
            "What are the best computer parts for a home server setup?",
            "Are there any new trends in modular PC cases?",
            "What are the best components for a dual-GPU setup?",
            "Which computer parts are trending for content creators?",
            "What are the best keyboards and mice for competitive gaming?",
            "Are there any new trends in liquid cooling systems?",
            "What are the best computer parts for a budget streaming setup?",
            "Which components are trending for mini-PC builds?",
            "What are the best external storage solutions for PCs?",
            "Are there any new trends in motherboard design for 2023?",
            "What are the best computer parts for a home theater PC (HTPC)?",
            "Which components are trending for cryptocurrency mining?",
            "What are the best computer parts for a hybrid work-from-home setup?",
            "Are there any new trends in fanless PC builds?",
            "What are the best components for a portable gaming PC?",
            "Which computer parts are trending for retro gaming builds?",
            "What are the best computer parts for a 3D rendering workstation?",
            "Are there any new trends in all-in-one (AIO) PCs?",
            "What are the best components for a multi-monitor setup?",
            "Which computer parts are trending for Linux-based systems?",
            "What are the best computer parts for a NAS (Network Attached Storage) build?",
            "Are there any new trends in custom water-cooling loops?",
            "What are the best components for a high-performance laptop replacement?",
            "Which computer parts are trending for esports enthusiasts?",
            "What are the best computer parts for a DIY home automation server?"]
    },
    {
        "tag": "history",
        "input": [
            "How have GPU prices changed over the past year?",
            "What is the price history of the latest Intel CPUs?",
            "Are SSD prices trending up or down in 2023?",
            "How have RAM prices fluctuated in the last six months?",
            "What is the historical price trend for high-end gaming motherboards?",
            "Have power supply prices increased due to demand?",
            "How do AMD GPU prices compare to NVIDIA over the past two years?",
            "What is the price history of PCIe 4.0 SSDs?",
            "Are there any price drops expected for DDR5 RAM soon?",
            "How have cooling system prices changed over time?",
            "What is the price trend for pre-built gaming PCs in 2023?",
            "How have monitor prices evolved over the past year?",
            "Are there any historical price trends for RGB components?",
            "What is the price history of external GPUs (eGPUs)?",
            "How have CPU cooler prices changed in recent months?",
            "What is the historical price trend for high-refresh-rate monitors?",
            "Are there any price fluctuations for mini-ITX components?",
            "How have storage drive prices changed over the past five years?",
            "What is the price history of mechanical keyboards?",
            "Are there any price trends for used computer parts?",
            "How have prices for liquid cooling systems changed over time?",
            "What is the historical price trend for gaming mice?",
            "Are there any price drops for older-generation GPUs?",
            "How have prices for Wi-Fi 6 networking components changed?",
            "What is the price history of high-capacity HDDs?",
            "Are there any price trends for all-in-one (AIO) coolers?",
            "How have prices for Thunderbolt-enabled devices changed?",
            "What is the historical price trend for ultra-wide monitors?",
            "Are there any price fluctuations for high-wattage PSUs?",
            "How have prices for VR-ready components changed over time?",
            "What is the price history of NAS drives?",
            "Are there any price trends for modular PC cases?",
            "How have prices for high-end audio peripherals changed?",
            "What is the historical price trend for 4K monitors?",
            "Are there any price drops for older CPUs like Intel 10th Gen?",
            "How have prices for RTX 40-series GPUs changed since their release?",
            "What is the price history of AMD Ryzen 7000-series CPUs?",
            "Are there any price trends for DDR4 RAM as DDR5 becomes more popular?",
            "How have prices for M.2 NVMe SSDs changed over the past year?",
            "What is the historical price trend for high-end gaming laptops?",
            "Are there any price drops for older AMD GPUs like the RX 6000 series?",
            "How have prices for Thunderbolt 4 docks and accessories changed?",
            "What is the price history of ultrawide gaming monitors?",
            "Are there any price fluctuations for high-end mechanical keyboards?",
            "How have prices for custom water-cooling components changed over time?",
            "What is the historical price trend for 144Hz monitors?",
            "Are there any price trends for used GPUs in the secondhand market?",
            "How have prices for Wi-Fi 6E routers and adapters changed?",
            "What is the price history of high-capacity SSDs (2TB and above)?",
            "Are there any price drops for older Intel CPUs like the 9th Gen?",
            "How have prices for high-end PC cases changed over the past two years?",
            "What is the historical price trend for gaming headsets?",
            "Are there any price fluctuations for high-performance fans?",
            "How have prices for external storage drives changed over time?",
            "What is the price history of 8K monitors?",
            "Are there any price trends for mini-PC components like the Intel NUC?",
            "How have prices for RGB lighting kits changed over the past year?",
            "What is the historical price trend for high-end motherboards?",
            "Are there any price drops for older-generation SSDs?",
            "How have prices for high-refresh-rate 4K monitors changed?",
            "What is the price history of high-end power supplies (1000W+)?",
            "Are there any price trends for used CPUs in the secondhand market?",
            "How have prices for PCIe 5.0 SSDs changed since their release?",
            "What is the historical price trend for ergonomic office chairs?",
            "Are there any price fluctuations for high-end capture cards?",
            "How have prices for high-capacity DDR5 RAM kits changed?",
            "What is the price history of high-end gaming keyboards?",
            "Are there any price trends for older-generation motherboards?",
            "How have prices for high-end audio interfaces changed over time?",
            "What is the historical price trend for 240Hz monitors?",
            "Are there any price drops for older gaming laptops?",
            "How have prices for high-end NAS drives changed over the past year?",
            "What is the price history of high-end gaming mice?",
            "Are there any price trends for used monitors in the secondhand market?",
            "How have prices for high-end VR headsets changed over time?",
            "What is the historical price trend for high-end streaming microphones?",
            "Are there any price fluctuations for high-end docking stations?",
            "How have prices for high-end gaming chairs changed over the past two years?",
            "What is the price history of high-end sound cards?",
            "Are there any price trends for older-generation peripherals?",
            "How have prices for high-end webcams changed over time?",
            "What is the historical price trend for high-end studio monitors?",
            "Are there any price drops for older-generation networking equipment?",
            "How have prices for high-end external GPUs (eGPUs) changed?"
        ]
    }
]
}